# ทำการวนซ้ำไปเรื่อยๆ ในช่วงระหว่าง 0 ถึง 10
# Note: range() หากใส่เลขแค่ตัวเดียว จะทำการสร้างช่วงของตัวเลขตั้งแต่ 0 ถึง (เลขที่ใส่ - 1)
for multipiler in range(11):

	# แสดงผลแม่สูตรคูณปัจจุบันในรูปแบบของ
	# "Table de {แม่สูตรคูณปัจจุบัน}:"
	# Note #1: print() หากใส่ `end=""` เข้าไปด้วย ก็จะทำให้ print ไม่ขึ้นบรรทัดใหม่หลังจากแสดงผลเสร็จ
	# Note #2: การใส่ `end="ตัวลงท้าย"` เข้าไปด้วย ก็จะทำให้ print แสดงผลตัวลงท้ายตามที่เรากำหนดได้
	print(f"Table de {multipiler}:", end="")

	# ทำการวนซ้ำไปเรื่อยๆ ในช่วงระหว่าง 0 ถึง 10 เพื่อนำมาคูณกับแม่สูตรคูณ โดยแสดงผลในแบบ
	# " {แม่คูณ คูณกับ ตัวเลข}" โดยไม่ขึ้นบรรทัดใหม่
	for number in range(11):
		print(f" {multipiler * number}", end="")

	# ทำการขึ้นบรรทัดใหม่หลังจากแสดงผลการคูณ
	# Note: print() โดยปกติจะมีค่า end="\n" (จะทำการขึ้นบรรทัดใหม่เมื่อแสดงผลเสร็จ)
	print()
